test_pitchingBox_singlePhase/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// dynamicFvMesh   dynamicMotionSolverFvMesh;

// motionSolverLibs (fvMotionSolvers);

// motionSolver    displacementLaplacian;

// // diffusivity  uniform;
// // diffusivity  directional (1 200 0);
// // diffusivity  motionDirectional (1 1000 0);
// // diffusivity  file motionDiffusivity;
// diffusivity  inverseDistance 1(floatingObjectBottom);

dynamicFvMesh       dynamicMotionSolverFvMesh;

motionSolverLibs   ("libfvMotionSolvers.so");

solver              velocityLaplacian;

diffusivity     inverseDistance (floatingObject);

// ************************************************************************* //
